programming/python/package-manage.org
* Overview

There're many tools to manage package for python
1. distutil
2. setuptools
3. pip

There're also some package formats (associate with package tools)
1. egg
2. sdist
3. wheel

** distutil

The official package tools which is built in python distribution.

** setuptools

- Wrap on distutil and provide much more features.
- Provide =easy_install= script
- use =Egg= format to release package (similar to jar for java program)

** pip

PIP is used to replace =easy_install= script and 
1. perfer release with format sdist rather than =egg=
2. parse =requirements.txt= for dependencies
3. VCS support

** wheel

Wheel is a zip file and is used to replace =egg= file format
1. generated by setuptools with =bdist_wheel= extension
2. generated by pip tools with =wheel= package
3. configured by =setup.cfg=

* Reference

- [[https://blog.zengrong.net/post/2169.html][Python 包管理工具解惑]]
