programming/python/package-manage.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>package-manage.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/programming/python/idiomatic-python-note.org.html">Prev: idiomatic-python-note.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/programming/python">Up: python</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/programming/python/pygame.org.html">Next: pygame.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="overview">Overview</h1>
<p>There're many tools to manage package for python</p>
<ol class="incremental">
<li>distutil</li>
<li>setuptools</li>
<li>pip</li>
</ol>
<p>There're also some package formats (associate with package tools)</p>
<ol class="incremental">
<li>egg</li>
<li>sdist</li>
<li>wheel</li>
</ol>
<h2 id="distutil">distutil</h2>
<p>The official package tools which is built in python distribution.</p>
<h2 id="setuptools">setuptools</h2>
<ul class="incremental">
<li>Wrap on distutil and provide much more features.</li>
<li>Provide <code>easy_install</code> script</li>
<li>use <code>Egg</code> format to release package (similar to jar for java program)</li>
</ul>
<h2 id="pip">pip</h2>
<p>PIP is used to replace <code>easy_install</code> script and</p>
<ol class="incremental">
<li>perfer release with format sdist rather than <code>egg</code></li>
<li>parse <code>requirements.txt</code> for dependencies</li>
<li>VCS support</li>
</ol>
<h2 id="wheel">wheel</h2>
<p>Wheel is a zip file and is used to replace <code>egg</code> file format</p>
<ol class="incremental">
<li>generated by setuptools with <code>bdist_wheel</code> extension</li>
<li>generated by pip tools with <code>wheel</code> package</li>
<li>configured by <code>setup.cfg</code></li>
</ol>
<h1 id="reference">Reference</h1>
<ul class="incremental">
<li><a href="https://blog.zengrong.net/post/2169.html">Python 包管理工具解惑</a></li>
</ul>

      </div>
    </section>
  </body>
</html>
